Autodesk.Navisworks.Api.Search
Defines a search that can be run to find ModelItems

Autodesk.Navisworks.Api.Search.#ctor
Create a clear search

Autodesk.Navisworks.Api.Search.#ctor(Autodesk.Navisworks.Api.Search)
Create a copy of another search
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed

Autodesk.Navisworks.Api.Search.CanMerge(Autodesk.Navisworks.Api.Search)
True if the search conditions and selection critera are compatible between this and another search
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'spec' is null
Throws System.ArgumentException:
Argument 'spec' has been Disposed

Autodesk.Navisworks.Api.Search.Clear
Clears search back to it's default state
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Search.FindAll(Autodesk.Navisworks.Api.Document,System.Boolean)
Returns a ModelItemCollection that represents the items specified by this Search in document.
document:
Document to search
reportProgress:
true if progress should be reported via normal Autodesk.Navisworks.Api.Application progress reporting
Throws System.ArgumentNullException:
Argument 'document' is null
Throws System.InvalidOperationException:
Search Selection contains explicit items from a different document
Throws Autodesk.Navisworks.Api.CanceledOperationException:
End user cancels operation through progress interface

Autodesk.Navisworks.Api.Search.FindAll(System.Boolean)
Returns a ModelItemCollection that represents the items specified by this Search in the document
which it is associated with.
reportProgress:
true if progress should be reported via normal Autodesk.Navisworks.Api.Application progress reporting
Throws System.NotSupportedException:
No document is associated with this Search
Throws Autodesk.Navisworks.Api.CanceledOperationException:
End user cancels operation through progress interface

Autodesk.Navisworks.Api.Search.FindFirst(Autodesk.Navisworks.Api.Document,System.Boolean)
Returns the first ModelItem specified by this Search in document. Returns null if none found.
document:
Document to search
reportProgress:
true if progress should be reported via normal Autodesk.Navisworks.Api.Application progress reporting
Throws System.ArgumentNullException:
Argument 'document' is null
Throws System.InvalidOperationException:
Search Selection contains explicit items from a different document
Throws Autodesk.Navisworks.Api.CanceledOperationException:
End user cancels operation through progress interface

Autodesk.Navisworks.Api.Search.FindFirst(System.Boolean)
Returns the first ModelItem specified by this Search in the document
which it is associated with. Returns null if none found.
reportProgress:
true if progress should be reported via normal Autodesk.Navisworks.Api.Application progress reporting
Throws System.NotSupportedException:
No document is associated with this Search
Throws Autodesk.Navisworks.Api.CanceledOperationException:
End user cancels operation through progress interface

Autodesk.Navisworks.Api.Search.FindIncremental(Autodesk.Navisworks.Api.Document,System.Boolean)
Returns an enumerable that steps through the items specified by this Search in document.
document:
Document to search
reportProgress:
true if progress should be reported via normal Autodesk.Navisworks.Api.Application progress reporting
Throws System.ArgumentNullException:
Argument 'document' is null
Throws System.InvalidOperationException:
Search Selection contains explicit items from a different document
Throws Autodesk.Navisworks.Api.CanceledOperationException:
End user cancels operation through progress interface

Autodesk.Navisworks.Api.Search.FindIncremental(System.Boolean)
Returns a an enumerable that steps through the items specified by this Search in the document
which it is associated with.
reportProgress:
true if progress should be reported via normal Autodesk.Navisworks.Api.Application progress reporting
Throws System.NotSupportedException:
No document is associated with this Search
Throws Autodesk.Navisworks.Api.CanceledOperationException:
End user cancels operation through progress interface

Autodesk.Navisworks.Api.Search.IsClear
True if selection is clear, and there are no search conditions
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Search.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Search.Locations
Locations within Selection to search. Default is DescendantsAndSelf.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Search.Merge(Autodesk.Navisworks.Api.Search)
Merges another Search into this Search, appending its conditions as a new group of conditions.
search:
Search to merge.
Throws System.InvalidOperationException:
A merge could not be performed, as the searches are incompatible e.g. different model selections searched.

Autodesk.Navisworks.Api.Search.PruneBelowMatch
When value is true, search ignores descendants of any matching model items. Default is true.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Search.SearchConditions
Search conditions that will be applied during search
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Search.Selection
Selection that will be searched
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Search.TryMerge(Autodesk.Navisworks.Api.Search)
Attempts to merge another Search into this Search, combining conditions of search as a new group of conditions. Returns true if
the merge is successful, and false if the Searches are incompatible e.g. different model selections searched.
search:
Search to merge.

Autodesk.Navisworks.Api.Search.ValueEquals(Autodesk.Navisworks.Api.Search)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.Search.ValueEquals(Autodesk.Navisworks.Api.Search,Autodesk.Navisworks.Api.Search)
Compares the two references 'By Value'